// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
// Задайте прямоугольный двумерный массив. Напишите программу, которая будет находить строку с наименьшей суммой элементов.

